Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения ячеистого склад</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада. </Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности ) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяЯчейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Зоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ряды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Полки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыгружатьВОборудование</Name>
					<Comment>Признак выгрузки ШК в торговое оборудование с памятью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСкладскихЯчеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСкладскихЯчеек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРаспределенияДопРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияДопРасходов</Name>
			<Comment>Способы распределения суммы по строкам номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСумме</Name>
					<Comment>Распределение на себестоимость по сумме</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличеству</Name>
					<Comment>Распределение на себестоимость по количеству</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВесу</Name>
					<Comment>Распределение на себестоимость по весу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоходыИРасходы</Name>
					<Comment>Без распределения на себестоимость</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Производители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Производители</Name>
			<Comment>Производители</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна производителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Некорректный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулыОбязательны</Name>
					<Comment>Признак обязательности заполнения артикула</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияУникальны</Name>
					<Comment>Признак уникальности наименований</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Синонимы</Name>
					<Comment>Синонимы производителей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним производителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Comment>Синоним является ошибкой</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДонорыАртикулов</Name>
					<Comment>Доноры артикулов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Comment>Производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЯчейкиХранения/Ext/ObjectModule.bsl
// Модуль справочника

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ЯчейкаСРазмещением Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// Очищает реквизит КартаСклада, вызывается при удалении и модификации ячеек
Функция ОчиститьМакетСклада()
	
	Если НЕ Владелец.КартаСклада.Получить() = Неопределено Тогда
		ФормаЭлементаСклада = Владелец.ПолучитьФорму("ФормаЭлемента");
		Если ФормаЭлементаСклада.Открыта() Тогда
			ВладелецОбъект = ФормаЭлементаСклада.ЭтотОбъект;
		Иначе
			ВладелецОбъект = Владелец.ПолучитьОбъект();
		КонецЕсли;
		ВладелецОбъект.КартаСклада = Новый ХранилищеЗначения(Неопределено);
		Попытка
			ВладелецОбъект.Записать();
		Исключение
			Сообщить("Невозможно выполнить очистку макета карты склада! Склад """ + СокрЛП(Строка(ВладелецОбъект)) + """ заблокирован.");
			Возврат Истина;
		КонецПопытки;
		
	КонецЕсли;
	Возврат ложь; 

КонецФункции // ОчиститьМакетСклада()
	
// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
//
// Параметры:
//  ДляЭлемента	– Булево			– Возвращаемая структура должна содержать реквизиты для проверки элемента.
//  ДляГруппы	– Булево 			– Возвращаемая структура должна содержать реквизиты для проверки группы элементов.
//
// Возвращаемое значение:
//   ОбязательныеРеквизиты   		– Структура, содержащая реквизиты для проверки элемента или группы элементов.
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("Код",1);
		Если ЯчейкаСРазмещением<> Неопределено И ЯчейкаСРазмещением Тогда
			ОбязательныеРеквизиты.Вставить("Зона",1);
			ОбязательныеРеквизиты.Вставить("Ряд",1);
			ОбязательныеРеквизиты.Вставить("Стеллаж",1);
			ОбязательныеРеквизиты.Вставить("Полка",1);
			ОбязательныеРеквизиты.Вставить("НомерЯчейки",1);
		КонецЕсли;
	КонецЕсли;
	
	Если ДляЭлемента Тогда
		Если Владелец.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
			ОбязательныеРеквизиты.Вставить("ШиринаЯчейки",1);
			ОбязательныеРеквизиты.Вставить("ДлинаЯчейки",1);
		КонецЕсли;
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;

	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки 			– Строка		– Описание ошибок.
//  ДопРеквизиты	– Структура		– Дополнительные реквизиты для проверки.
//  Заполнение		– Булево		– Флаг для проверки заполнения.
//  Уникальность	– Булево		– Флаг для проверки уникальности.
//
// Возвращаемое значение:
//   Булево				   			– Правильность заполнения объекта.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = Истина;
	
	//в данном справочнике реквизит "Код" - обязательный для заполнения независимо от прав
	Если Заполнение и обЗначениеНеЗаполнено(ЭтотОбъект.Код) Тогда
		Результат=Ложь;
		Ошибки=Ошибки+"Реквизит ""Номер ячейки"" не заполнен !"+Символы.ПС;
	КонецЕсли;
	
	Возврат Результат И спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
// Параметры:
//  БлокироватьРеквизиты	– Строка	– Блокируемые на изменение реквизиты объекта.
//
// Возвращаемое значение:
//   Булево		   					– Допустимость изменения объекта.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Обработка изменения реквизитов справочников
//
// Параметры:
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры	– Структура		– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
//
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Отказ = Отказ ИЛИ ОчиститьМакетСклада();
	// свойство Недоступна должно меняться при смене пометки удаления
	Если НЕ Отказ И НЕ ЭтоГруппа И НЕ (ПометкаУдаления = ЭтотОбъект.Ссылка.ПометкаУдаления) Тогда
		Недоступна = ПометкаУдаления;
	КонецЕсли;	
	
	//Корельский
	//Если изменился НомерЯчейки для иерархической структуры, то нужно менять код;
	НомерЯчейкиДляПроверки = ПривестиИдентификатор(НомерЯчейки);
	Если Ссылка.НомерЯчейки <> НомерЯчейкиДляПроверки И ЗначениеЗаполнено(Стеллаж) Тогда
		НомерЯчейки = НомерЯчейкиДляПроверки;
		Код = Полка.Код + "-" + НомерЯчейки;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И НЕ Отказ Тогда
		ЗаписатьИзмененияНоменклатуре();
	КонецЕсли;
	
	//}
КонецПроцедуры // ПередЗаписью()

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко 20151021 ++
	
	ТекЯчейкаОбъект = ЭтотОбъект;
	ТекАвтор = ПараметрыСеанса.Пользователь;
	ТекВалюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ТекВид = Перечисления.ВидыНоменклатуры.Адрес;
	ТекТип = Справочники.ТипыНоменклатуры.Адрес;
	ТекСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	ТекСпособРаспределенияДопРасходов=Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы;
	ТекСтатьяДопРасходов=Справочники.СтатьиДоходовИРасходов.Операционные;
	ТекБазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
	ТекПроизводитель = Справочники.Производители.Неизвестен;
	ТекСтрана = ТекПроизводитель.СтранаПроисхождения;
	ТекГруппаНоменклатуры = Справочники.Номенклатура.Адреса;
	
	НовЭл = Справочники.Номенклатура.ПустаяСсылка();
	
	АртикулПоиска = СокрЛП(ЭтотОбъект.Код);
	
	НовЭл = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",АртикулПоиска);
	
	ФлНовый=Ложь;
	
	Если НовЭл = Справочники.Номенклатура.ПустаяСсылка() Тогда
		НовЭл = Справочники.Номенклатура.СоздатьЭлемент();
		ФлНовый = Истина;
	Иначе
		НовЭл = НовЭл.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ФлНовый Тогда
		НовЭл.Автор = ТекАвтор;
		НовЭл.Артикул = АртикулПоиска;
		НовЭл.БазоваяЕдиницаИзмерения = ТекБазоваяЕдиницаИзмерения;
		НовЭл.Наименование = АртикулПоиска;
		НовЭл.НаименованиеИностранное = АртикулПоиска;
		НовЭл.НаименованиеПолное = АртикулПоиска;
		НовЭл.Производитель = ТекПроизводитель;
		НовЭл.СтранаПроисхождения = ТекСтрана;
		НовЭл.Родитель = ТекГруппаНоменклатуры;
		НовЭл.ВидНоменклатуры=ТекВид ;
		НовЭл.ТипНоменклатуры=ТекТип; 
		НовЭл.СтавкаНДС=ТекСтавкаНДС;
		НовЭл.ВалютаУчета=ТекВалюта;
		НовЭл.СпособРаспределенияДопРасходов=ТекСпособРаспределенияДопРасходов;
		НовЭл.СтатьяДопРасходов=ТекСтатьяДопРасходов;
		НовЭл.ЗапретЗакупки=Истина;
		НовЭл.ЗапретПродажи=Истина;
		НовЭл.СнятаСПроизводства=Истина;
		НовЭл.Комментарий="Элемент создан при записи ячейки "+ТекущаяДата()+" пользователем "+ТекАвтор;
		//Бондаренко++ 20201029
		НовЭл.УстановитьНовыйКод("");
		//Бондаренко-- 20201029
		
		Попытка 
			НовЭл.Записать();
			//Сообщить("1).Записан элемент "+НовЭл,СтатусСообщения.Информация);		
		Исключение
			Сообщить("1).ОШИБКА!!! Не удалось записать элемент.",СтатусСообщения.ОченьВажное);		
		КонецПопытки;
		
		СпрЕдИзм = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		СпрЕдИзм.Владелец = НовЭл.Ссылка;
		СпрЕдИзм.ЕдиницаПоКлассификатору=Справочники.КлассификаторЕдиницИзмерения.шт;
		СпрЕдИзм.Наименование = Справочники.КлассификаторЕдиницИзмерения.шт;
		СпрЕдИзм.Коэффициент=1;
		//Бондаренко++ 20201029
		СпрЕдИзм.УстановитьНовыйКод("");
		//Бондаренко-- 20201029

		СпрЕдИзм.Записать();
		
		НовЭл.ОсновнаяЕдиницаИзмерения=СпрЕдИзм.Ссылка;
		
		Попытка 
			НовЭл.Записать();
			//Сообщить("2).Записан элемент "+НовЭл,СтатусСообщения.Внимание);		
		Исключение
			Сообщить("2).ОШИБКА!!! Не удалось записать элемент.",СтатусСообщения.ОченьВажное);		
		КонецПопытки;
	КонецЕсли; 
	
	
	ШК = "";
	
	НаборЗаписей = РегистрыСведений.ШтрихКоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(НовЭл.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьТек Из НаборЗаписей Цикл
		ШК = ЗаписьТек.ШтрихКод;
		Прервать;
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ШК) Тогда
		НовЗапРег = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
		НовЗапРег.Объект = ТекЯчейкаОбъект.Ссылка;
		НовЗапРег.ШтрихКод = ШК;
		НовЗапРег.ВыгружатьВОборудование=Ложь;
		Попытка
			НовЗапРег.Записать();
			Сообщить("Записан ШтрихКод = "+ШК+" для ячейки "+ТекЯчейкаОбъект.Ссылка,СтатусСообщения.Информация);
		Исключение
			Сообщить("ОШИБКА! Не удалось записать ШтрихКод = "+ШК+" для ячейки "+ТекЯчейкаОбъект.Ссылка,СтатусСообщения.ОченьВажное);
		КонецПопытки;	
	КонецЕсли; 
   	
	//Бондаренко 20151021 --
КонецПроцедуры // ПриЗаписи()

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Отказ = ОчиститьМакетСклада();
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоКода()

//Корельский {
Процедура ЗаписатьИзмененияНоменклатуре()
	//Если меняется номер ячейки, то нужно это отразить в регистре
	Попытка
		Если Ссылка.Код <> Код Тогда
			//Узнаем, не было ли записей от того же пользователя в течение 5 минут, если были, то не будем писать.
			ДатаЗаписи = ТекущаяДата();
			
			ЗапросНоменклатуры = Новый Запрос();
			ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
			                           |	НоменклатураЯчейкиХранения.Ссылка КАК Номенклатура
			                           |ПОМЕСТИТЬ НоменклатураДляЗаписи
			                           |ИЗ
			                           |	Справочник.Номенклатура.ЯчейкиХранения КАК НоменклатураЯчейкиХранения
			                           |ГДЕ
			                           |	НоменклатураЯчейкиХранения.ЯчейкаХранения = &ЯчейкаХранения
			                           |
			                           |СГРУППИРОВАТЬ ПО
			                           |	НоменклатураЯчейкиХранения.Ссылка,
			                           |	НоменклатураЯчейкиХранения.СкладКомпании
			                           |;
			                           |
			                           |////////////////////////////////////////////////////////////////////////////////
			                           |ВЫБРАТЬ
			                           |	НоменклатураДляЗаписи.Номенклатура,
			                           |	ИсторияСкладскихЯчеекСрезПоследних.Период
			                           |ИЗ
			                           |	НоменклатураДляЗаписи КАК НоменклатураДляЗаписи
			                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСкладскихЯчеек.СрезПоследних(, СкладКомпании = &СкладДляПроверки) КАК ИсторияСкладскихЯчеекСрезПоследних
			                           |		ПО НоменклатураДляЗаписи.Номенклатура = ИсторияСкладскихЯчеекСрезПоследних.Номенклатура
			                           |			И (ИсторияСкладскихЯчеекСрезПоследних.Пользователь = &Пользователь
			                           |				И РАЗНОСТЬДАТ(ИсторияСкладскихЯчеекСрезПоследних.Период, &ДатаПроверки, МИНУТА) < 5)
			                           |ГДЕ
			                           |	ИсторияСкладскихЯчеекСрезПоследних.Период ЕСТЬ NULL";
			ЗапросНоменклатуры.УстановитьПараметр("ЯчейкаХранения", Ссылка);
			ЗапросНоменклатуры.УстановитьПараметр("ДатаПроверки", ДатаЗаписи);
			ЗапросНоменклатуры.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
			ЗапросНоменклатуры.УстановитьПараметр("СкладДляПроверки", Владелец);
			
			
			РезультатЗапроса = ЗапросНоменклатуры.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				НаборЗаписейРегистра = РегистрыСведений.ИсторияСкладскихЯчеек.СоздатьНаборЗаписей();
				НаборЗаписейРегистра.Отбор.СкладКомпании.Установить(Владелец);
				НаборЗаписейРегистра.Прочитать();
				
				ВыборкаИзЗапроса = РезультатЗапроса.Выбрать();
				Пока ВыборкаИзЗапроса.Следующий() Цикл
					СтрокаРегистра = НаборЗаписейРегистра.Добавить();
					СтрокаРегистра.Номенклатура = ВыборкаИзЗапроса.Номенклатура;
					СтрокаРегистра.СкладКомпании = Владелец;
					СтрокаРегистра.НомерЯчейки = Ссылка.Код;
					СтрокаРегистра.Пользователь = ПараметрыСеанса.Пользователь;
					СтрокаРегистра.Период = ДатаЗаписи;
				КонецЦикла;
				НаборЗаписейРегистра.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Функция ПривестиИдентификатор(Идентификатор)
	Попытка 
		Идентификатор = Формат(Число(СокрЛП(Идентификатор)), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	Исключение
		Идентификатор = СокрЛП(Идентификатор);
	КонецПопытки;
	Возврат Идентификатор;
КонецФункции

//Корельский
		
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
